#These are packages I use normally. These should be installed with pacman. Code on how would be presented in README#
amd-ucode
android-tools
ark
base
base-devel
btrfs-progs
code
dkms
dnf (if you're referring to the DNF package manager, this is not commonly used on Arch Linux)
dolphin
dosfstools
efibootmgr
egl-wayland
exfat-utils
fail2ban
firewalld
foot
gedit
git
gnuplot
grub
gst-plugin-pipewire
gvfs-gphoto2
gvfs-mtp
htop
linux
linux-firmware
linux-headers
meson
mtpfs
nano
ncdu
net-tools
network-manager-applet
networkmanager
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
plasma-meta
plasma-workspace
putty
python-docutils
rust
smartmontools
sof-firmware
tmux
unzip
usbutils
vi
vim
virtualbox
vulkan-radeon
waybar
wget
wine
wireless_tools
wireplumber
xdg-utils
xdotool
xf86-video-amdgpu
xf86-video-ati
xorg-xinit
zoom
zram-generator
xclip
yay
