#These are packages I use normally. These should be installed with pacman. Code on how would be presented in README#
acpilight-git
amd-ucode
android-tools
ark
base
base-devel
btrfs-progs
cheese
cloudflare-warp-bin
code
discord
dkms
dnf
dolphin
dosfstools
efibootmgr
egl-wayland
exfat-utils
fail2ban
firewalld
foot
gedit
git
github-desktop-bin
github-desktop-bin-debug
gnuplot
google-chrome
grim
grub
gst-plugin-pipewire
gvfs-gphoto2
gvfs-mtp
htop
i3-wm
i3lock
i3status
iwd
kate
konsole
less
libpulse
libva-mesa-driver
linux
linux-firmware
linux-headers
meson
mtpfs
nano
ncdu
neofetch
net-tools
network-manager-applet
networkmanager
pipewire
pipewire-alsa
pipewire-jack
plasma-meta
plasma-workspace
pulseaudio
putty
python-docutils
rust
sfwbar
sfwbar-debug
smartmontools
snapd
sof-firmware
stow
sway
swaybg
swaylock-blur-multimonitor-git
tmux
totk-mod-manager-bin
ttf-font-awesome
ttf-roboto-mono
ufw
unzip
usbutils
vi
vim
virtualbox
vulkan-radeon
waybar
wget
wine
wireless_tools
wireplumber
wofi
xclip
xdg-utils
xdotool
xf86-video-amdgpu
xf86-video-ati
xorg-xinit
yay
yay-debug
zoom
zram-generator
